In [85]:
import pandas as pd #Data ANALYSIS

In [86]:
list1=[1,2,3,4,5]
series1=pd.Series(list1)
print(series1) # 1d

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [87]:
students={"student1":{"name":"Mahidhar",
                      "age":21
                     },
          "student2":{"name":"Love",
                      "age":21
                     }
         }

In [88]:
DataFrame1=pd.DataFrame(students)
print(DataFrame1) # 2d/tables

      student1 student2
name  Mahidhar     Love
age         21       21

In [89]:
DataFrame1

      student1 student2
name  Mahidhar     Love
age         21       21

In [90]:
student={"student1":{"name":"Mahidhar",
                      "age":21
                     }
         }
df=pd.DataFrame(student)
print(df)

      student1
name  Mahidhar
age         21

In [91]:
df

      student1
name  Mahidhar
age         21

In [92]:
print(series1[1]) # index call

2

In [93]:
phone_no=[7095921465,9642121734,8121111204,9390299551]
s=pd.Series(phone_no,index=["Mahidhar","MOM","AMAMMA","ANNAYA"]) # self indexing
print(s)

Mahidhar    7095921465
MOM         9642121734
AMAMMA      8121111204
ANNAYA      9390299551
dtype: int64

In [94]:
date={"Day1":3,
      "Day4":4,
      "Day3":5,
      }
d=pd.Series(date) # by using Dictionary indxing series
print(d)

Day1    3
Day4    4
Day3    5
dtype: int64

In [95]:
c=pd.Series(d,dtype="float64") # type conversion
c

Day1    3.0
Day4    4.0
Day3    5.0
dtype: float64

In [96]:
# data Frame 
ds1=pd.DataFrame({"A":[1,2,3,4,5],"B":[10,20,30,40,50]})
ds2=pd.DataFrame({"A":[1,2,3,4,6],"D":[100,200,300,400,600]})

In [97]:
ds1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [98]:
ds2

   A    D
0  1  100
1  2  200
2  3  300
3  4  400
4  6  600

# Merge the Data Frames

1.inner join 
2.left join
3.right join
4.outer join

In [101]:
# 1 inner join
pd.merge(ds1,ds2,on="A",indicator=True)

   A   B    D _merge
0  1  10  100   both
1  2  20  200   both
2  3  30  300   both
3  4  40  400   both

In [102]:
# left join
pd.merge(ds1,ds2,on="A",indicator=True,how="left")

   A   B      D     _merge
0  1  10  100.0       both
1  2  20  200.0       both
2  3  30  300.0       both
3  4  40  400.0       both
4  5  50    NaN  left_only

In [103]:
# right join
pd.merge(ds1,ds2,on="A",indicator=True,how="right")

   A     B    D      _merge
0  1  10.0  100        both
1  2  20.0  200        both
2  3  30.0  300        both
3  4  40.0  400        both
4  6   NaN  600  right_only

In [104]:
# outer join
pd.merge(ds1,ds2,on="A",indicator=True,how="outer")

   A     B      D      _merge
0  1  10.0  100.0        both
1  2  20.0  200.0        both
2  3  30.0  300.0        both
3  4  40.0  400.0        both
4  5  50.0    NaN   left_only
5  6   NaN  600.0  right_only

In [105]:
# Series
s1=pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [106]:
s2=pd.Series([5,6,7,8])
s2

0    5
1    6
2    7
3    8
dtype: int64

In [107]:
pd.concat([s1,s2])

0    1
1    2
2    3
3    4
0    5
1    6
2    7
3    8
dtype: int64

In [108]:
pd.concat([ds1,ds2])

   A     B      D
0  1  10.0    NaN
1  2  20.0    NaN
2  3  30.0    NaN
3  4  40.0    NaN
4  5  50.0    NaN
0  1   NaN  100.0
1  2   NaN  200.0
2  3   NaN  300.0
3  4   NaN  400.0
4  6   NaN  600.0

In [109]:
pd.concat([ds1,ds2],axis=1)

   A   B  A    D
0  1  10  1  100
1  2  20  2  200
2  3  30  3  300
3  4  40  4  400
4  5  50  6  600

In [110]:
ds2["Total"]=ds2["A"]+ds2["D"]
ds2

   A    D  Total
0  1  100    101
1  2  200    202
2  3  300    303
3  4  400    404
4  6  600    606

In [111]:
ds2["Remark"]=ds2["Total"]>=250
ds2

   A    D  Total  Remark
0  1  100    101   False
1  2  200    202   False
2  3  300    303    True
3  4  400    404    True
4  6  600    606    True